#빈 자리는 빈공간으로 두고, 오른쪽 정렬을 하되, 총 10자리 공간을 확보

#10칸의 공간을 확보하고 500을 출력해라
print("{0: >10} ".format(500))

#양수일 땐 +표시, 음수일 땐 -표시, +를 추가해 준다.
print("{0: >+10} ".format(500))
print("{0: >+10} ".format(-500))

#왼쪽 정렬하고, 빈칸은 _로 채움
print("{0:_<+10} ".format(500))

# 3자리 마다 콤마를 찍어주기
print("{0:,}".format(100000000000))

# 3자리 마다 콤마를 찍어주기 and +-부호도 붙이기
print("{0:+,}".format(100000000000))
print("{0:+,}".format(-100000000000))

#3자리마다 콤마, 부호, 자릿수 확보
#돈이 많으면 행복하니까 빈자리는 ^로 채우기
#부호의 방향에 따라 ^의 위치가 달라진다. <일땐 오른쪽에 ^, >일땐 왼쪽에 ^
print("{0:^<+30,}".format(100000000000))

#소수점 출력
print("{0:f}".format(5/3))

#소수점 특정 자리수 까지만 표시 (소수점 셋째자리에서 반올림)
print("{0:.2f}".format(5/3))